Revit 2024 API
FabricationDimensionDefinition Class
 Fabricaition dimension definition
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class FabricationDimensionDefinition : IDisposable
Visual Basic
Public Class FabricationDimensionDefinition _
	Implements IDisposable
Visual C++
public ref class FabricationDimensionDefinition : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationDimensionDefinition
See Also
FabricationDimensionDefinition Members
Autodesk.Revit.DB Namespace